app/views/subscription/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "traders".* FROM "traders" WHERE "traders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<div>
	<%= User.find(subscription.user_id).name %>
	<%= Trader.find(subscription.trader_id).name %>