app/views/subscription/new.html.erb

		<%= trader.name %>
		<% if ( Subscription.where(["trader_id = ? and user_id = ?", trader.id, @user]) ).exists? %>
---
SELECT  1 AS one FROM "subscriptions" WHERE (trader_id = 0 and user_id = 2) LIMIT ?  [["LIMIT", 1]]