app/controllers/subscription_controller.rb

SELECT "subscriptions".* FROM "subscriptions"
---
	def index
		@subscriptions = Subscription.all

DELETE FROM "subscriptions" WHERE "subscriptions"."id" = ?  [["id", 54]]
---
	def destroy
		@user = session[:user_id]
		@trader = params[:trader]
		sns_client ||= Aws::SNS::Client.new
		@sub_id = Subscription.find_by(user_id: @user, trader_id: @trader)

		if Subscription.destroy(@sub_id.id)