app/controllers/subscription_controller.rb

	def index
		@user = User.find(params[:id])
		@device = @user.user_devices.first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def new
		@traders = Trader.all
---
SELECT "traders".* FROM "traders"

	def create
		user_id = params[:user_id]
		trader_id = params[:trader_id]

      	@user = User.find(user_id)
		@trader = Trader.find(trader_id)

		devices_list = @user.user_devices
		for dev in devices_list.to_a do
			@subscription = Subscription.where(:trader_id =>
			trader_id, :user_device_id => dev.id).first_or_create
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "traders".* FROM "traders" WHERE "traders"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "subscriptions" ("user_id", "trader_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["trader_id", 2], ["created_at", "2019-07-16 14:31:43.444164"], ["updated_at", "2019-07-16 14:31:43.444164"]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."trader_id" = ? LIMIT ?  [["user_id", 2], ["trader_id", 2], ["LIMIT", 1]]

	def logout
		user_id = params[:user_id]
		device_token = params[:token]

		@user_device = UserDevice.where(:user_id => user_id,
			:device_token => device_token).first

		@subscription_list = @user_device.subscriptions
		for subscription in @subscription_list.to_a do
---
SELECT "subscriptions".* FROM "subscriptions" WHERE (user_id = 2 and trader_id = '1')

	def destroy
		@user = User.find(params[:user_id])
		@trader = Trader.find(params[:trader_id])

		devices_list = @user.user_devices
		for dev in devices_list.to_a do
			@sub = Subscription.where(:trader_id => @trader.id, :user_device_id => dev.id).first
			puts "-------------"
			puts @sub.trader_id
			puts "-------------"
			@sub_arn = @sub.subscription_arn

			if Subscription.destroy(@sub.id)
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."trader_id" = ? LIMIT ?  [["user_id", 2], ["trader_id", 2], ["LIMIT", 11]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" IN (?, ?, ?)  [["id", 0], ["id", 2], ["id", 2]]